/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：
* 作    者：lhb Steven
* 完成日期：2016/7/11
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#ifndef __LCD_H
#define __LCD_H

#include "Type.h"

void LcdInit(void);
void LCDString(u8 x,u8 y,u8 *p,u8 time);
void LCDNum(u8 num);
/**********************************************函数定义***************************************************** 
* 函数名称: void LcdDrawClear(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/12
************************************************************************************************************/ 
void LcdDrawClear(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void LcdDraw16(u8 line,u8 row) 
* 输入参数: u8 line,u8 row 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/12
************************************************************************************************************/ 
void LcdDraw16(u8 line,u8 row,const u8 *ptr) ;
/**********************************************函数定义***************************************************** 
* 函数名称: void LcdDraw18(u8 line,u8 row,const u8 *ptr)) 
* 输入参数: u8 line,u8 row,const u8 *ptr) 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/12
************************************************************************************************************/ 
void LcdDraw18(u8 line,u8 row,const u8 *ptr) ;
/**********************************************函数定义***************************************************** 
* 函数名称: void LcdDrawNum8(u8 line, u8 row, const u8 *ptr) 
* 输入参数: u8 line, u8 row, const u8 *ptr 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/12
************************************************************************************************************/ 
void LcdDrawNum8(u8 line, u8 row, u8 num, u8 num2);
/**********************************************函数定义***************************************************** 
* 函数名称: void LcdDraeBq8x16(u8 line, u8 row, u8 num) 
* 输入参数: u8 line, u8 row, u8 num 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/7/12
************************************************************************************************************/ 
void LcdDraeBq8x16(u8 line, u8 row, u8 num);

#endif




